Back-end.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.0 r1840935">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Microservice" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">4000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">2</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">ms-pos-mur-apollo-pt.apps.dev.corp.btpn.co.id</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/ms-pos/v1/stores/10001</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">x-reference-no</stringProp>
                <stringProp name="Header.value">cb452e2a4fef</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">x-id-token</stringProp>
                <stringProp name="Header.value">eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJhdF9oYXNoIjoiQkNtZ0QzT2dHWTNBSjBqTFlCMjM3dyIsInN1YiI6IjYyODE1NTQ1MDU0NSIsImFkZHJlc3MiOnsiZm9ybWF0dGVkIjpudWxsfSwiYXVkaXRUcmFja2luZ0lkIjoiYTdhMzk3ODAtNTE5OC00YWU1LTk5NGItNjE1Y2MxZWMwMjRhLTQzMzQiLCJpc3MiOiJodHRwOi8vYnRwbm9wZW5hbS5kZXYuY29ycC5idHBuLmNvLmlkOjgwODAvb3BlbmFtL29hdXRoMi9BUE9MTE8iLCJ0b2tlbk5hbWUiOiJpZF90b2tlbiIsIm5vbmNlIjoicmFuZG9tIiwiYWNjZXNzVHlwZSI6WyJBQzAyOkFkbWluaXN0cmF0b3IiLCJBQzAzOkthc2lyIiwiQUMwMTpQZW1pbGlrVXNhaGEiXSwiYXVkIjoiamVuaXVzIiwiY19oYXNoIjoibUJvbktwY2I0Ujd3V2Iwc3RuZmlpUSIsIm9yZy5mb3JnZXJvY2sub3BlbmlkY29ubmVjdC5vcHMiOiIxNDkxYzA3MC1mYzhjLTRkODgtYmI0Mi1kZjA0M2E4ZTc4MTciLCJhenAiOiJqZW5pdXMiLCJhdXRoX3RpbWUiOjE1MjI5MTM2NTQsIm5hbWUiOiJhZGl0MTEiLCJyZWFsbSI6Ii9BUE9MTE8iLCJwaG9uZV9udW1iZXIiOiIwODEyMzQ1Njc4OTAxIiwiZXhwIjoxNTI3NzYzNjE2LCJ0b2tlblR5cGUiOiJKV1RUb2tlbiIsImlhdCI6MTUyMjkxMzY1NCwiZmFtaWx5X25hbWUiOiJhZGl0MTEiLCJqdGkiOiI5NjM0NzQzMy1iMzE5LTQwY2MtODI0MS01NzAxMzNkZmI2ZDkifQ.fjgeqfzPEU8uO5JPWsytPDXl9CW7LSIRRT_7yHTUER8</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">requestId</stringProp>
                <stringProp name="Header.value">cb452e2a4fef</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">true</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
            <boolProp name="ResultCollector.error_logging">true</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>